app/controllers/microposts_controller.rb

INSERT INTO "microposts" ("user_id", "created_at", "updated_at", "content") VALUES (1, '2011-07-30 18:17:45.296875', '2011-07-30 18:17:45.296875', 'test again 1-2--3
---
  def create
    @micropost  = current_user.microposts.build(params[:micropost])
    if @micropost.save

DELETE FROM "microposts" WHERE "microposts"."id" = 1
---
   def destroy
    @micropost.destroy