app/controllers/users_controller.rb

  def index
    @title = "All users"
    @users = User.paginate(:page => params[:page])
---
SELECT "users".* FROM "users" LIMIT 30 OFFSET 0

def show
    @user = User.find(params[:id])
    @microposts = @user.microposts.paginate(:page => params[:page])
---
SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT 1
SELECT "microposts".* FROM "microposts" WHERE ("microposts".user_id = 1) ORDER BY microposts.created_at DESC LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "microposts" WHERE ("microposts".user_id = 1)

 def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO "users" ("email", "updated_at", "name", "encrypted_password", "salt", "created_at") VALUES ('adsf@a.com', '2011-07-28 11:06:43.470843', 'Benny', '84be3c177dd2adfd1e7e3dfbf63edbecb2617573e96677485f1217f3853e8419', 'e3ffe9a6ff4686d742cb852a23018c0d7f33d0d86c972f939bf1d341df49c371', '2011-07-28 11:06:43.470843')

  def update
    @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1